Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Because service lifecycle is handled centrally, any shutdown listeners or other logic for stopping services should also be removed.
ja_jp: サービスのライフサイクルが一元的に管理されるため、シャットダウンリスナーやサービスを停止するためのその他のロジックも削除する必要があります。

source: Because starting a Kafka broker can be long, Dev Services for Kafka uses https://redpanda.com[Redpanda], a Kafka compatible broker which starts in ~1 second.
ja_jp: Kafkaブローカーの起動には時間がかかることがあるため、Dev Services for Kafkaは、~1秒で起動するKafka互換ブローカーである link:https://redpanda.com[Redpanda] を使用しています。

source: Because starting a Kafka broker can be long, Dev Services for Kafka uses https://vectorized.io/redpanda[Redpanda], a Kafka compatible broker which starts in ~1 second.
ja_jp: Kafkaブローカーの起動には時間がかかるため、Dev Services for Kafkaでは、1秒程度で起動するKafka互換ブローカーの link:https://vectorized.io/redpanda[Redpanda]を使用しています。

source: Because the LRA coordinator needs to call back your application from the container, we need to expose the application on any host address, not just `localhost`. So the Dev Services for LRA coordinator injects `quarkus.http.host=0.0.0.0` into your application configuration which means that your application is accessible from any machine running in the same network as your development machine. *This is a potential security risk*, so use the LRA Dev Services only if you are sure that it is safe.
ja_jp: LRA コーディネーターはコンテナーからアプリケーションにコールバックする必要があるため、アプリケーションを `localhost` だけでなく、任意のホストアドレスで公開する必要があります。そのため、LRA コーディネーター 用 Dev Services は、アプリケーション設定に `quarkus.http.host=0.0.0.0` を注入します。これは、開発マシンと同じネットワークで実行されているどのマシンからもアプリケーションにアクセスできることを意味します。*これは潜在的なセキュリティリスクです*。そのため、LRA Dev Services は、安全であると確信できる場合にのみ使用してください。

source: Because the Quarkus Maven plugin itself runs in the JVM started by Maven, and because some (rare) Quarkus extensions need to load application classes during the build, it may be necessary to pass the same flags to the JVM running Maven.
ja_jp: Quarkus Mavenプラグイン自体は、Mavenによって起動されたJVMで実行され、一部の（まれな）Quarkusエクステンションではビルド中にアプリケーションクラスをロードする必要があるため、Mavenを実行しているJVMに同じフラグを渡すことが必要になる場合があります。

source: Because the application still runs on the JVM, you continue to benefit from the JIT compiler, your preferred garbage collector, and all other JVM optimizations, preserving the high throughput typically associated with the JVM.
ja_jp: アプリケーションは依然として JVM 上で実行されるため、JIT コンパイラ、好みのガーベージコレクタ、およびその他のすべての JVM 最適化の恩恵を受け続け、通常 JVM に関連付けられている高いスループットを維持します。

source: Because the application uses Bearer token authentication, you must first obtain an access token from the Keycloak server to access the application resources:
ja_jp: アプリケーションはベアラートークン認証を使用するため、アプリケーションリソースにアクセスするには、まず Keycloak サーバーからアクセストークンを取得する必要があります。

source: Because the end method is annotated with `@LRA(value = LRA.Type.MANDATORY)`, the context header must be present otherwise the method will return an error response code:
ja_jp: end メソッドは `@LRA(value = LRA.Type.MANDATORY)` でアノテーションされているため，コンテクストヘッダが存在していなければならず，そうでなければメソッドはエラー応答コードを返すことになります。

source: Because the interaction with the database is non-blocking and asynchronous, we need to use asynchronous constructs to implement our HTTP resource. Quarkus uses Mutiny as its central reactive programming model. So, it supports returning Mutiny types (`Uni` and `Multi`) from HTTP endpoints. Also, our Fruit Panache entity exposes methods using these types, so we only need to implement the _glue_.
ja_jp: データベースとのやりとりはノンブロッキングで非同期なので、HTTPリソースを実装するために非同期の構造を使用する必要があります。Quarkusは、中心となるリアクティブプログラミングモデルとしてMutinyを使用しています。そのため、HTTPエンドポイントからMutinyタイプ（ `Uni` と `Multi` ）を返すことをサポートしています。また、Fruit Panacheのエンティティはこれらの型を使ったメソッドを公開していますので、私たちは _糊_ を実装するだけで済みます。

source: Because the processor does not handle starting the service, it should never return a `RunningDevService`.
ja_jp: プロセッサーはサービスの開始を処理しないため、 `RunningDevService` を返してはいけません。

source: Because the resource has not been modified since that date, this saves on sending the resource but can also help your users detect the concurrent modification. For example, one client wants to update the resource, but another user has modified it since. You can follow the previous `GET` request with this update:
ja_jp: なぜなら、そのリソースはその日以降に変更されていないからです。これはリソースを送信する手間を省くだけでなく、ユーザーが同時に変更されたことを検出するのにも役立ちます。たとえば、あるクライアントがリソースを更新したいが、別のユーザーがその後にリソースを変更したとしましょう。この場合、前の `GET` リクエストに続いて、この更新を行うことができます。

source: Because the resource has not been modified since that date. This saves on sending the resource, but can also help your users detect concurrent modification, for example, let's suppose that one client wants to update the resource, but another user has modified it since. You can follow the previous `GET` request with this update:
ja_jp: なぜなら、そのリソースはその日以降に変更されていないからです。これはリソースを送信する手間を省くだけでなく、ユーザーが同時に変更されたことを検出するのにも役立ちます。たとえば、あるクライアントがリソースを更新したいが、別のユーザーがその後にリソースを変更したとしましょう。この場合、前の `GET` リクエストに続いて、この更新を行うことができます。

source: Because the test runs in a different port, we also need to include an `application.properties` in our `src/test/resources` with the following content:
ja_jp: テストは別のポートで実行されるため、 `src/test/resources` に、次に示す内容で `application.properties` を含める必要があります。

source: Because there's so much JavaScript needed to set WebAuthn up in the browser, the Quarkus WebAuthn extension ships with a JavaScript library to help you talk to the WebAuthn endpoints, at `/q/webauthn/webauthn.js`. You can set it up like this:
ja_jp: ブラウザーで WebAuthn を設定するには多くの JavaScript が必要なため、Quarkus WebAuthn エクステンションには、WebAuthn のエンドポイントとの対話を支援する JavaScript ライブラリーが同梱されています (`/q/webauthn/webauthn.js`）。以下のように設定できます。

source: Because this behavior is unexpected and can lead to data loss, an interceptor rolls back any unfinished transactions when closing a connection. However, if you use XA transactions, the transaction manager handles the rollback.
ja_jp: この動作は予期せぬものであり、データの損失につながる可能性があるため、インターセプターは接続を閉じる際に未完了のトランザクションをロールバックします。 しかし、XA トランザクションを使用している場合は、トランザクションマネージャがロールバックを行います。

source: Because this data above will be inserted into the database without Hibernate Search's knowledge, it won't be indexed -- unlike upcoming updates coming through Hibernate ORM operations, which will be synchronized automatically to the full text index.
ja_jp: 上記のデータは Hibernate Search の知識なしでデータベースに注入されるため、Hibernate ORM 操作を通じて行われる今後の更新 (全文インデックスに自動的に同期される) とは異なり、インデックス化されません。

source: Because this use case has hard and soft constraints, use the `HardSoftScore` class to represent the score:
ja_jp: このユースケースにはハードとソフトの制約があるため、スコアを表すためには `HardSoftScore` クラスを使用します。

source: Because users can clean/revert to default in this screen by deleting the storage item, an extension might want to react on this:
ja_jp: ユーザーは、この画面でストレージアイテムを削除することにより、クリーンアップ/デフォルトに戻すことができるため、エクステンションがこれに反応したい場合があります:

source: Because we are using JUnit 5, the version of the https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] must be set, as the default version does not support Junit 5:
ja_jp: JUnit 5を使用しているので、 link:https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin]のバージョンを設定する必要があります。デフォルトのバージョンはJUnit 5をサポートしていない為です。

source: Because we are using JUnit, the version of the https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] must be set, as the default version does not support JUnit:
ja_jp: JUnit を使用しているため、 https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] のバージョンを設定する必要があります。デフォルトのバージョンは JUnit をサポートしていないためです。

source: Because we are using Quarkus REST and the _imperative_ mailer, we need to add the `@Blocking` annotation. We will see later the reactive variant.
ja_jp: Quarkus RESTと _命令型_ メーラーを使用しているため、 `@Blocking` アノテーションを追加する必要があります。リアクティブバリアントについては後で説明します。

source: Because we are using RESTEasy Reactive and the _imperative_ mailer, we need to add the `@Blocking` annotation. We will see later the reactive variant.
ja_jp: RESTEasy Reactiveと _命令型_ mailerを使用しているので、 `@Blocking` アノテーションを追加する必要があります。リアクティブ型バージョンについては後ほど説明します。

source: Because we rely on <<dev-services,Dev Services>>, the Elasticsearch schema will automatically be dropped and re-created on each application startup in tests and dev mode (unless <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-schema-management-strategy,`quarkus.hibernate-search-standalone.schema-management.strategy`>> is set explicitly).
ja_jp: <<dev-services,Dev Services>> に依存していることから、Elasticsearch スキーマは、 (<<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-schema-management-strategy,`quarkus.hibernate-search-standalone.schema-management.strategy`>> が明示的に設定されていない限り) テストと開発モードで アプリケーションの起動ごとに自動的に削除され、再作成されます。

source: Because we rely on <<dev-services,Dev Services>>, the database and Elasticsearch schema will automatically be dropped and re-created on each application startup in tests and dev mode (unless <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-schema-management-strategy,`quarkus.hibernate-search-orm.schema-management.strategy`>> is set explicitly).
ja_jp: <<dev-services,Dev Services>> に依存していることから、データベースと Elasticsearch スキーマは、 (<<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-schema-management-strategy,`quarkus.hibernate-search-orm.schema-management.strategy`>> が明示的に設定されていない限り) テストと開発モードで アプリケーションの起動ごとに自動的に削除され、再作成されます。

source: Because we rely on <<dev-services,Dev Services>>, the database and Elasticsearch schema will automatically be dropped and re-created on each application startup in tests and dev mode (unless link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.schema-management.strategy[`quarkus.hibernate-search-orm.schema-management.strategy`] is set explicitly).
ja_jp: <<dev-services,Dev Services>> 依存しているため、データベースとElasticsearchスキーマはテストと開発モードのアプリケーションの起動ごとに自動的に削除され、再作成されます（ link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.schema-management.strategy[`quarkus.hibernate-search-orm.schema-management.strategy`] が明示的に設定されていなければ、このようなことはありません）。

source: Because we want to consume messages from the `quotes-requests` queue into the `requests` channel, we need to configure this association. Open the `src/main/resources/application.properties` file and add:
ja_jp: `quotes-requests` キューから `requests` チャネルへメッセージを消費したいので、この関連付けを設定する必要があります。 `src/main/resources/application.properties` ファイルを開き、以下を追加します。

source: Because we want to delegate login and registration to the default Quarkus WebAuthn endpoints, we need to enable them in configuration (`src/main/resources/application.properties`):
ja_jp: ログインと登録をデフォルトの Quarkus WebAuthn エンドポイントに委譲したいため、設定内 (`src/main/resources/application.properties`) でそれらを 有効にする必要があります。

source: Because we write to a database, we must run this method in a transaction. Yet, sending the entity to Kafka happens asynchronously. The operation returns a `CompletionStage` (or a `Uni` if you use a `MutinyEmitter`) reporting when the operation completes. We must be sure that the transaction is still running until the object is written. Otherwise, you may access the object outside the transaction, which is not allowed.
ja_jp: データベースに書き込むため、トランザクションでこのメソッドを実行する必要があります。しかし、エンティティーを Kafka に送信することは非同期で行われます。操作が完了すると、操作は `CompletionStage` (または `MutinyEmitter` を使用する場合は `Uni` ) レポートを返します。オブジェクトが書き込まれるまで、トランザクションがまだ実行されていることを確認する必要があります。そうしないと、トランザクションの外側でオブジェクトにアクセスする可能性がありますが、これは許可されていません。

source: Because we write to a database, we must run this method in a transaction. Yet, sending the entity to Kafka happens asynchronously. We can achieve this by using `.sendAndAwait()` or `.sendAndForget()` on the `MutinyEmitter`, or `.send().toCompletableFuture().join()` on the `Emitter`.
ja_jp: データベースに書き込むため、このメソッドはトランザクション内で実行する必要があります。 ただし、エンティティーの Kafka への送信は非同期で行われます。 これを実現するには、 `MutinyEmitter` で `.sendAndAwait()` または `.sendAndForget()` を使用するか、 `Emitter` で `.send().toCompletableFuture().join()` を使用します。

source: Before 1.10, all of the Hibernate ORM configuration properties were fixed at build time. Mostly for optimization purposes.
ja_jp: 1.10 以前では、すべての Hibernate ORM 設定プロパティーがビルド時に修正されていました。主に最適化のためのものです。

source: Before 21.3.0, when Quarkus instructed a GraalVM distribution to print out the call tree, the resulting output would be a single text file representing the call tree in a https://www.graalvm.org/reference-manual/native-image/Reports[custom tree format]. This text file would contain a lot of duplicated information and could be as big as several gigabytes in size.
ja_jp: 21.3.0より前のバージョンでは、QuarkusがGraalVMディストリビューションにコールツリーの出力を指示すると、 link:https://www.graalvm.org/reference-manual/native-image/Reports[カスタムツリー形式]のコールツリーを表す1つのテキストファイルが出力されていました。このテキストファイルには、多くの重複した情報が含まれており、サイズは数ギガバイトにもなります。

source: Before accessing programmatically the cached data, you need to retrieve an `io.quarkus.cache.Cache` instance. The following sections will show you how to do that.
ja_jp: キャッシュされたデータにプログラムでアクセスする前に、 `io.quarkus.cache.Cache` のインスタンスを取得する必要があります。以下のセクションでは、その方法をご紹介します。

source: Before all the tests, the extension will generate Quarkus projects in the specified languages with the given codestart using mocked data and real data. You can find those generated projects in the `target/quarkus-codestart-test` directory. You can open the `real-data` ones in your IDE or play with them using the terminal. *The real data is the easiest way to iterate on your extension codestart development.*
ja_jp: すべてのテストの前に、このエクステンションは、指定された言語で、指定されたCodestartで、モックされたデータと実際のデータを使ってQuarkusプロジェクトを生成します。生成されたプロジェクトは、 `target/quarkus-codestart-test` ディレクトリにあります。 `real-data` のプロジェクトは IDE で開くことができますし、ターミナルで操作することもできます。 *実データは、エクステンションCodestartの開発を繰り返し行う最も簡単な方法です。*

source: Before all, make sure to have an App Engine environment initialized for your Google Cloud project, if not, initialize one via `gcloud app create --project=[YOUR_PROJECT_ID]`.
ja_jp: まずはじめに、Google Cloud プロジェクト用に App Engine 環境が初期化されていることを確認してください。もしまだであれば、 `gcloud app create --project=[YOUR_PROJECT_ID]` によって初期化してください。

source: Before building a container image from the Dockerfiles shown below, you need to update the default `.dockerignore` file, as it filters everything except the `target` directory. In order to build inside a container, you need to copy the `src` directory. Thus, edit your `.dockerignore` and remove the `*` line.
ja_jp: 以下のDockerファイルからコンテナーイメージをビルドする前に、デフォルトの `.dockerignore` ファイルを更新する必要があります。これは、 `target` ディレクトリ以のすべてがフィルタリングされるためです。コンテナー内でビルドするため、 `src` ディレクトリをコピーする必要があります。そのために、 `.dockerignore` を編集し、その内容を更新し、 `*` の行を削除します。

source: Before building a programmatic cache key, you need to know how cache keys are built by the annotations API when an annotated method is invoked. This is explained in the <<cache-keys-building-logic>> section of this guide.
ja_jp: プログラムキャッシュキーを構築する前に、アノテーションメソッドが呼び出されたときにアノテーションAPIによってキャッシュキーがどのように構築されるかを知っておく必要があります。これについては、このガイドの <<cache-keys-building-logic> セクションで説明されています。

source: Before building a programmatic cache key, you need to know how cache keys are built by the annotations API when an annotated method is invoked. This is explained in the xref:cache-keys-building-logic[Cache keys building logic] section of this guide.
ja_jp: プログラムによるキャッシュ・キーを構築する前に、アノテーション・メソッドが呼び出されたときにアノテーションAPIによってキャッシュ・キーがどのように構築されるかを知っておく必要があります。これについては、本ガイドの xref:cache-keys-building-logic[キャッシュキー構築ロジック] のセクションで説明します。

source: Before building a programmatic cache key, you need to know how cache keys are built by the annotations API when an annotated method is invoked:
ja_jp: プログラムによるキャッシュ・キーを構築する前に、アノテーション・メソッドが呼び出されたときにアノテーションAPIによってキャッシュ・キーがどのように構築されるかを知っておく必要があります:

source: Before building security into your Quarkus applications, learn about the xref:security-architecture.adoc[Quarkus Security architecture] and the different authentication mechanisms and features that you can use.
ja_jp: Quarkusアプリケーションにセキュリティを組み込む前に、 xref:security-architecture.adoc[Quarkus Securityアーキテクチャ] と、使用できるさまざまな認証メカニズムと機能について学んでください。

source: Before building security into your Quarkus applications, learn about the xref:security-architecture.adoc[Quarkus Security architecture] and the different authentication mechanisms and features you can use.
ja_jp: Quarkus アプリケーションにセキュリティーを組み込む前に、xref:security-architecture.adoc[Quarkus Security アーキテクチャー] と、使用できるさまざまな認証メカニズムと機能を理解する必要があります。

source: Before coding, we need to generate the classes used to implement and consume gRPC services. In a terminal, run:
ja_jp: コーディングの前に、gRPCサービスを実装して消費するためのクラスを生成する必要があります。ターミナルで以下を実行します。

source: Before deploying your function, you need to create a bucket.
ja_jp: 関数をデプロイする前に、バケットを作成する必要があります。

source: Before fixing the test, let's review the options available for testing Quarkus endpoints secured by OIDC. These options might vary, depending on which flow your application supports and how you prefer to test. Endpoints which use OIDC authorization code flow can be tested using xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing[one of these options] and endpoints which use Bearer token authentication can be tested using xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing[one of these options].
ja_jp: テストを修正する前に、OIDCによって保護されたQuarkusエンドポイントをテストするために利用可能なオプションを確認しましょう。これらのオプションは、アプリケーションがどのフローをサポートしているか、またどのようにテストを行うかによって異なります。OIDC 認証コードフローを使用するエンドポイントは、 xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing[これらのオプションのいずれか] を使用してテストすることができ、ベアラートークン認証を使用するエンドポイントは、 xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing[これらのオプションのいずれか] を使用してテストすることができます。

source: Before going further, be sure to have a working container runtime (Docker, podman) environment. If you use Docker on Windows you should share your project's drive at Docker Desktop file share settings and restart Docker Desktop.
ja_jp: 次に進む前に、動作するコンテナーランタイム (Docker、podman) 環境があることを確認してください。Windows で Docker を使用している場合は、Docker Desktop のファイル共有設定でプロジェクトのドライブを共有し、Docker Desktop を再起動する必要があります。

source: Before going further, let's have a look at the HTTP layer of Quarkus. Quarkus HTTP support is based on a non-blocking and reactive engine (Eclipse Vert.x and Netty). All the HTTP requests your application receive are handled by _event loops_ (I/O Thread) and then are routed towards the code that manages the request. Depending on the destination, it can invoke the code managing the request on a worker thread (Servlet, Jax-RS) or use the IO Thread (reactive route). Note that because of this, a reactive route must be non-blocking or explicitly declare its blocking nature (which would result by being called on a worker thread).
ja_jp: 先に進む前に、QuarkusのHTTPレイヤーを見てみましょう。QuarkusのHTTPサポートは、ノンブロッキングでリアクティブなエンジン(Eclipse Vert.xとNetty)に基づいています。アプリケーションが受け取るすべてのHTTPリクエストは、 _イベントループ_ (I/Oスレッド)によって処理され、リクエストを管理するコードに向かってルーティングされます。宛先に応じて、ワーカースレッド(Servlet、Jax-RS)でリクエストを管理するコードを呼び出すか、IOスレッド(Reactive Routes)を使用します。このため、Reactive Routesはノンブロッキングであるか、そのブロッキング性を明示的に宣言しなければならないことに注意してください (ワーカースレッド上で呼び出されることで結果的にブロッキングされます)。

source: Before going further, open the `src/main/resource/application.properties` file and add:
ja_jp: その前に、 `src/main/resource/application.properties` ファイルを開き、次を追加してください。

source: Before going further, open the `src/main/resources/application.properties` file and add:
ja_jp: 先に進む前に、 `src/main/resources/application.properties` ファイルを開き、以下を追加します:

source: Before going further, we need to discuss discovery vs. selection.
ja_jp: その前に、ディスカバリーとセレクションについて説明する必要があります。

source: Before importing in _prod_ mode, make sure you configured `quarkus.redis.flush-before-load` accordingly.
ja_jp: _prod_ モードでインポートする前に、 `quarkus.redis.flush-before-load` を適切に設定してください。

source: Before jumping into Quarkus we evaluated many stacks, Spring Boot, Micronaut, even Guice was a consideration at one point. We also looked at more drastic changes like switching over to Python or .NET Core.
ja_jp: Spring Boot、Micronaut、さらにはGuiceも検討したことがありました。また、Pythonや.NET Coreへの切り替えなど、より抜本的な変更も検討しました。

source: Before launching our Docker build, we need to update the default `.dockerignore` file as it filters everything except the `target` directory. As we plan to build inside a container, we need to copy the `src` directory. Thus, edit your `.dockerignore` and update the content.
ja_jp: Dockerビルドを起動する前に、デフォルトの `.dockerignore` ファイルを更新する必要があります。これは、 `target` ディレクトリ以のすべてがフィルタリングされるためです。コンテナ内にビルドする予定であるため、 `src` ディレクトリをコピーする必要があります。そのために、 `.dockerignore` を編集し、その内容を更新します。

source: Before moving forward, let's explain first how Prometheus works. Prometheus uses a pull model to get metrics from applications. This means that Prometheus will scrape or watch endpoints to pull metrics from.
ja_jp: 先に進む前に、まずPrometheusの仕組みを説明しましょう。Prometheus は、アプリケーションからメトリクスを取得するためにプル・モデルを使用します。つまり、Prometheus はメトリクスを取得するためにエンドポイントをスクレイピングしたり、ウォッチしたりします。

source: Before publishing your extension to the xref:tooling.adoc[Quarkus tooling], make sure that the following requirements are met:
ja_jp: エクステンションを link:tooling.html[Quarkusツール]に公開する前に、以下の要件が満たされていることを確認してください。

source: Before running the application, don't forget to stop the hot reload mode (hit `CTRL+C`), or you will have a port conflict.
ja_jp: アプリケーションを実行する前に、 `CTRL+C` でホットリロードモードを停止することを忘れないでください 。停止しないと、ポートが衝突します。

source: Before starting the Podman machine, set it to prefer rootful container execution:
ja_jp: Podman マシンを起動する前に、ルートフルコンテナー実行を優先するように設定します:

source: Before starting the application, let's first start the Kafka broker and Apicurio Registry:
ja_jp: アプリケーションを開始する前に、まず Kafka ブローカーと Apicurio Registry を起動します。

source: Before the `/login` handler is given control, Quarkus OIDC removes the OIDC redirect `code` and `state` properties and redirects the user to the same `/login` endpoint - this is done to minimize a risk of these parameters remaining visible in the user browser if the applications returns an application error after completing the authorization code flow, with the `code` and `state` query parameters still present in the current browser view. If preferred, this final redirect can be disabled with `quarkus.oidc.authentication.remove-redirect-parameters=false`.
ja_jp: `/login` ハンドラーに制御が渡される前に、Quarkus OIDC は OIDC リダイレクトの `code` および `state` プロパティーを削除し、ユーザーを同じ `/login` エンドポイントにリダイレクトします。これは、認可コードフローの完了後にアプリケーションがエラーを返した場合に、 `code` や `state` クエリーパラメーターが現在のブラウザービューに残ったままになり、ユーザーのブラウザーにこれらのパラメーターが表示され続けるリスクを最小限に抑えるために行われます。必要に応じて、 `quarkus.oidc.authentication.remove-redirect-parameters=false` でこの最終リダイレクトを無効にできます。

source: Before the bearer access token sent on the initial HTTP request expires, you can send a new bearer access token as part of a message and update current `SecurityIdentity` attached to the WebSocket server connection:
ja_jp: 最初の HTTP リクエストで送信されたベアラーアクセストークンが期限切れになる前に、新しいベアラーアクセストークンをメッセージの一部として送信し、WebSocket サーバー接続にアタッチされた現在の `SecurityIdentity` を更新できます。

source: Before the endpoint method is identified: pre-matching request filter
ja_jp: エンドポイントメソッドが識別される前: 事前マッチングリクエストフィルター

source: Before the endpoint method is identified: pre-routing request filter
ja_jp: エンドポイントメソッドが識別される前: 事前ルーティングリクエストフィルター

source: Before using UPX, we need to measure the disk space and memory usage of the non-compressed native executable. To do that, we need the native executable:
ja_jp: UPX を使用する前に、圧縮されていないネイティブ実行可能ファイルのディスク容量とメモリ使用量を測定する必要があります。そのためには、ネイティブ実行可能ファイルが必要です。

source: Before using the invoker, you first need to build your function via `mvn package`.
ja_jp: invokerを使用する前に、 `mvn package` で関数をビルドする必要があります。

source: Before using the invoker, you first need to build your function via:
ja_jp: invokerを使用する前に、まず、以下のように関数をビルドする必要があります。

source: Before using this extension, ensure the following:
ja_jp: このエクステンションを使用する前に、次の点を確認してください。
